tutorials/lagrangian/sprayFoam/aachenBomb/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

psiChemistryModel ODEChemistryModel<gasThermoPhysics>;

chemistry       off;

chemistrySolver ode;

initialChemicalTimeStep 1e-07;

turbulentReaction yes;

Cmix Cmix [0 0 0 0 0] 1;

odeCoeffs
{
    solver          SIBS;
    eps             0.05;
}


// ************************************************************************* //
